# UsSurveyFeet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..UsSurveyFeet Property
UnitTypeId Class See Also
---
US survey feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId UsSurveyFeet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UsSurveyFeet As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ UsSurveyFeet {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace